apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mzef_features.h
/************************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mzef_features.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ************************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZEF_FEATURES_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZEF_FEATURES_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/
/* Register/Flash Offsets ***********************************************************/

/* Device ID, Revision, and Configuration (SFR PIC32MZ_CONFIG_K1BASE) */

#define PIC32MZ_CFGCON_OFFSET    0x0000 /* Configuration control register */
#define PIC32MZ_DEVID_OFFSET     0x0020 /* Device ID and revision register */
#define PIC32MZ_SYSKEY_OFFSET    0x0030 /* System key register */
#define PIC32MZ_CFGEBIA_OFFSET   0x00c0 /* External bus interface address pin configuration register */
#define PIC32MZ_CFGEBIC_OFFSET   0x00d0 /* External bus interface address pin control register */
#define PIC32MZ_CFGPG_OFFSET     0x00e0 /* Permission group configuration register */

/* Alternate Device Configuration (Boot Flash PIC32MZ_BOOTCFG_K1BASE) */

#define PIC32MZ_ADEVCFG3_OFFSET  0x0040 /* Alternate device configuration word 3 */
#define PIC32MZ_ADEVCFG2_OFFSET  0x0044 /* Alternate device configuration word 2 */
#define PIC32MZ_ADEVCFG1_OFFSET  0x0048 /* Alternate device configuration word 1 */
#define PIC32MZ_ADEVCFG0_OFFSET  0x004c /* Alternate device configuration word 0 */
#define PIC32MZ_ADEVCP3_OFFSET   0x0050 /* Alternate device code protect word 3 */
#define PIC32MZ_ADEVCP2_OFFSET   0x0054 /* Alternate device code protect word 2 */
#define PIC32MZ_ADEVCP1_OFFSET   0x0058 /* Alternate device code protect word 1 */
#define PIC32MZ_ADEVCP0_OFFSET   0x005c /* Alternate device code protect word 0 */
#define PIC32MZ_ADEVSIGN3_OFFSET 0x0060 /* Alternate device signature word 3 */
#define PIC32MZ_ADEVSIGN2_OFFSET 0x0064 /* Alternate device signature word 2 */
#define PIC32MZ_ADEVSIGN1_OFFSET 0x0068 /* Alternate device signature word 1 */
#define PIC32MZ_ADEVSIGN0_OFFSET 0x006c /* Alternate device signature word 0 */

/* Device Configuration (Boot Flash PIC32MZ_BOOTCFG_K1BASE) */

#define PIC32MZ_DEVCFG3_OFFSET   0x00c0 /* Device configuration word 3 */
#define PIC32MZ_DEVCFG2_OFFSET   0x00c4 /* Device configuration word 2 */
#define PIC32MZ_DEVCFG1_OFFSET   0x00c8 /* Device configuration word 1 */
#define PIC32MZ_DEVCFG0_OFFSET   0x00cc /* Device configuration word 0 */
#define PIC32MZ_DEVCP3_OFFSET    0x00d0 /* Device code protect word 3 */
#define PIC32MZ_DEVCP2_OFFSET    0x00d4 /* Device code protect word 2 */
#define PIC32MZ_DEVCP1_OFFSET    0x00d8 /* Device code protect word 1 */
#define PIC32MZ_DEVCP0_OFFSET    0x00dc /* Device code protect word 0 */
#define PIC32MZ_DEVSIGN3_OFFSET  0x00e0 /* Device signature word 3 */
#define PIC32MZ_DEVSIGN2_OFFSET  0x00e4 /* Device signature word 2 */
#define PIC32MZ_DEVSIGN1_OFFSET  0x00e8 /* Device signature word 1 */
#define PIC32MZ_DEVSIGN0_OFFSET  0x00ec /* Device signature word 0 */

/* Device ADC Calibration (Boot Flash PIC32MZ_DEVSN_K1BASE) */

#define PIC32MZ_DEVADC0_OFFSET   0x0000 /* ADC0 Calibration */
#define PIC32MZ_DEVADC1_OFFSET   0x0004 /* ADC1 Calibration */
#define PIC32MZ_DEVADC2_OFFSET   0x0008 /* ADC2 Calibration */
#define PIC32MZ_DEVADC3_OFFSET   0x000c /* ADC3 Calibration */
#define PIC32MZ_DEVADC4_OFFSET   0x0010 /* ADC4 Calibration */
#define PIC32MZ_DEVADC7_OFFSET   0x001c /* ADC7 Calibration */

/* Device Serial Number (Boot Flash PIC32MZ_DEVSN_K1BASE) */

#define PIC32MZ_DEVSN0_OFFSET    0x0020 /* Device serial number 0 */
#define PIC32MZ_DEVSN1_OFFSET    0x0024 /* Device serial number 1 */

/* Register/Flash Addresses *********************************************************/

/* Device ID, Revision, and Configuration (SFR PIC32MZ_CONFIG_K1BASE) */

#define PIC32MZ_CFGCON           (PIC32MZ_CONFIG_K1BASE+PIC32MZ_CFGCON_OFFSET)
#define PIC32MZ_DEVID            (PIC32MZ_CONFIG_K1BASE+PIC32MZ_DEVID_OFFSET)
#define PIC32MZ_SYSKEY           (PIC32MZ_CONFIG_K1BASE+PIC32MZ_SYSKEY_OFFSET)
#define PIC32MZ_CFGEBIA          (PIC32MZ_CONFIG_K1BASE+PIC32MZ_CFGEBIA_OFFSET)
#define PIC32MZ_CFGEBIC          (PIC32MZ_CONFIG_K1BASE+PIC32MZ_CFGEBIC_OFFSET)
#define PIC32MZ_CFGPG            (PIC32MZ_CONFIG_K1BASE+PIC32MZ_CFGPG_OFFSET)

/* Alternate Device Configuration (Boot Flash PIC32MZ_BOOTCFG_K1BASE) */

#define PIC32MZ_ADEVCFG3         (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCFG3_OFFSET)
#define PIC32MZ_ADEVCFG2         (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCFG2_OFFSET)
#define PIC32MZ_ADEVCFG1         (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCFG1_OFFSET)
#define PIC32MZ_ADEVCFG0         (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCFG0_OFFSET)
#define PIC32MZ_ADEVCP3          (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCP3_OFFSET)
#define PIC32MZ_ADEVCP2          (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCP2_OFFSET)
#define PIC32MZ_ADEVCP1          (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCP1_OFFSET)
#define PIC32MZ_ADEVCP0          (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVCP0_OFFSET)
#define PIC32MZ_ADEVSIGN3        (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVSIGN3_OFFSET)
#define PIC32MZ_ADEVSIGN2        (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVSIGN2_OFFSET)
#define PIC32MZ_ADEVSIGN1        (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVSIGN1_OFFSET)
#define PIC32MZ_ADEVSIGN0        (PIC32MZ_BOOTCFG_K1BASE+PIC32MZ_ADEVSIGN0_OFFSET)

